frontend/controllers/EffectController.php

    public function actionMainwindow()
    {
        $model = new Effect_provider_add();
        if ($model->load(Yii::$app->request->post())) {
            $model->save();
---
INSERT INTO `providers` (`name`, `COUNT`, `ERRORS`, `WARNINGS`, `STORE_COUNT`) VALUES ('test_new', 1, 1, 1, 2)